# FamilySymbolId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstanceFilter..::..FamilySymbolId Property
FamilyInstanceFilter Class See Also
---
The family symbol id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId FamilySymbolId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilySymbolId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ FamilySymbolId {
	ElementId^ get ();
}
```

# See Also
FamilyInstanceFilter Class
Autodesk.Revit.DB Namespace